//
//  失敗メッセージ非表示スキル ver1.00
//
// ------------------------------------------------------
// Copyright (c) 2016 Yana
// Released under the MIT license
// http://opensource.org/licenses/mit-license.php
// ------------------------------------------------------
//
// author Yana
//

var Imported = Imported || {};
Imported['FailureMessageHideSkill'] = 1.00;
/*:
 * @plugindesc ver1.00/失敗メッセージが表示されないスキルやアイテムを設定できるようにします。
 * @author Yana
 * 
 * @help ------------------------------------------------------
 * 使用方法
 * ------------------------------------------------------
 * スキルやアイテムのメモ欄に
 * <失敗非表示>
 * または
 * <FailureHide>
 * と記述すると、そのスキルは失敗時のメッセージが表示されなくなります。
 * 
 * ------------------------------------------------------
 * 利用規約
 * ------------------------------------------------------
 * 当プラグインはMITライセンスで公開されています。
 * 使用に制限はありません。商用、アダルト、いずれにも使用できます。
 * 二次配布も制限はしませんが、サポートは行いません。
 * 著作表示は任意です。行わなくても利用できます。
 * 要するに、特に規約はありません。
 * バグ報告や使用方法等のお問合せはネ実ツクールスレ、または、Twitterにお願いします。
 * https://twitter.com/yanatsuki_
 * 素材利用は自己責任でお願いします。
 * ------------------------------------------------------
 * 更新履歴:
 * ver1.00:
 * 公開
 */
(function(){
	////////////////////////////////////////////////////////////////////////////////////
	
	var parameters = PluginManager.parameters('FailureMessageHideSkill');
	
	////////////////////////////////////////////////////////////////////////////////////
	
	DataManager.isHideFailure = function(item) {
		return !!item.note.match(/(?:失敗非表示|FailureHide)/);
	};
	
	////////////////////////////////////////////////////////////////////////////////////
	
	var __GAction_apply = Game_Action.prototype.apply;
	Game_Action.prototype.apply = function(target) {
		__GAction_apply.call(this,target);
		if (DataManager.isHideFailure(this.item())){
			this.makeSuccess(target);
		}
	}
	
	////////////////////////////////////////////////////////////////////////////////////
}());